do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلو" -- msg 
rs[1] = "  هْـٌﮩٌﮧٌ﴿🙃﴾ۙﮩٌـ୭ٌ୭ـْلوُّات†😻☝️  " -- reply 

ws[2] = "كرهك" -- msg 
rs[2] = "دولي عساس انه احبك🍃" -- reply 

ws[3] = "شلونكم" -- msg 
rs[3] = "تٌـٌـمـــ༄༅ـٌـٌإأإآمـ و اٍْنـْﱡِـ👈youـٍُتٍۜة ☺️🌹" -- reply 

ws[4] = "بوسني" -- msg 
rs[4] = " ٲٳٲمــﮨ﴿💋﴾ﮨﮨﮨﮨ﴿😚﴾ﮨــوٱآاﮨـٍٰۣۗح✵❤ لحليكك/ج " -- reply 

ws[5] = "احبك" -- msg 
rs[5] = "صـ❲❥❳ـہۣۙدگـﮧِّ† 😻🙌 خـجـ😅ـلت" -- reply 

ws[6] = "جوعان" -- msg 
rs[6] = "طبك مرص 😉😉😙😗"-- reply 

ws[7] = "باي" -- msg 
rs[7] = " ﭘــًًٍٍّّّْــًٍٍُُّّّّْ✋ــٍٍُّّّاأٍٍّّأٍّﯾﮧٍّ🏃  " -- reply 

ws[8] = "اكرهك" -- msg 
rs[8] = "عـلساس آٌنـّ'ℳέ'ـّي أحـبٍّـٍـٍـُـِՀօvεٍـٍـٍكـُّ💓 😝" -- reply 

ws[9] = "اتفل" -- msg 
rs[9] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply 

ws[10] = "سوسو" -- msg 
rs[10] = "اﯛﯛﯛﯛيــْـــلـٍـيٍِ❥ عـلـ🍃ـيهه صـ🌚❤️ـاكه" -- reply 

ws[11] = "تفاعل ماكو" -- msg 
rs[11] = "بركه بيك" -- reply 

ws[12] = "مرحبا" -- msg 
rs[12] = "مـراحـ🌹ـب نـورت/ي🌹🍃" -- reply 

ws[13] = "انجب" -- msg 
rs[13] = "لا❌لا تحجي على الضلع لا❌لا بل45 ع راسك😒👆" -- reply 

ws[14] = "زاحف" -- msg 
rs[14] = "زاحف ع اختك مثلا🌚☝️🏽️" -- reply 

ws[15] = "ميمي" -- msg 
rs[15] = "صـ😻ـاكة الكـgяθυρـٍْـْْروب 🌚❤️" -- reply 

ws[16] = "مطور" -- msg 
rs[16] = "@m1_l1" -- reply 

ws[17] = "حمودي" -- msg 
rs[17] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" 
-- the main function 
ws[18] = "رورو" -- msg 
rs[18] = "قاهرتكم🐸🍃" -- reply 

ws[19] = "طن" -- msg 
rs[19] = "كش عاع🌚✌️🏻" -- reply 

ws[20] = "بتيخه" -- msg 
rs[20] = "ضـ🌚❤️ــلعة عــ😴🍃ـلــوش" -- reply 

ws[21] = "السلام عليكم" -- msg 
rs[21] = "ۆعلـِْ♡̨̐ـِْيگمَ آلسَـِْ♡̨̐ـِْامَ" -- reply 

ws[22] = "مرض" -- msg 
rs[22] = "بـحلـكك 😴َ" -- reply 

ws[23] = "😒" -- msg 
rs[23] = "ﺷﺒﮧ❃ہيكہ/ج.  كالب خـلـ🌚ـقتك🚶🏻" -- reply 

ws[24] = "🌚" -- msg 
rs[24] = "منور صخام الجدر😹☝" -- reply 

ws[25] = "بوسه" -- msg 
rs[25] = "امــہـ😘😚😘😚😘ــہــواااااح" -- reply 

ws[26] = "شبيك" -- msg 
rs[26] = "ديٌّــ﴿🌝🚬﴾ــًُي" -- reply 

ws[27] = "وين" -- msg 
rs[27] = "بالــســ🚗ــيــارﮭﮧ" -- reply 

ws[28] = "انته وين" -- msg 
rs[28] = "بالــبــ🏠ــيــت" -- reply 

ws[29] = "وينك" -- msg 
rs[29] = "بالــســ🚗ــيــارﮭﮧ" -- reply 

ws[30] = "شكرا" -- msg 
rs[30] = "{ •• الـّ~ـعـفو •• }" -- reply 

ws[31] = "ولو" -- msg 
rs[31] = "شُـگـ{ôħᎯɴêȘ}ــرآآ" -- reply 

ws[23] = "تمام" -- msg 
rs[23] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣" -- reply 

ws[33] = "دوم" -- msg 
rs[33] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَبْضّ قَلبْگ/ۈۈمْ}⌣" -- reply 

ws[34] = "منور" -- msg 
rs[34] = "نِْـِْـــِْ([💡])ِْــــًِـًًْـــِْـِْـِْـورِْكِْ" -- reply 

ws[35] = "غنيلي" -- msg 
rs[35] = " كلب كلب وين وين غايب عليه يومين لا تغيب اكثر حبيبي خاف اموت من ا لحنين @m1_l1" -- reply 

ws[36] = "😡" -- msg 
rs[36] = "امشي لك حماوة" -- reply 

ws[37] = "تخليني" -- msg 
rs[37] = "  هايه اخلاقك😻☝️  " -- reply 

ws[38] = "🙈" -- msg 
rs[38] = "اوي عيني تستحي سندس🍃" -- reply 

ws[39] = "اريد اكبل" -- msg 
rs[39] =  " ☺وشسويلك🌹" -- reply 

ws[40] = "ضوجه" -- msg 
rs[40] = " ودنيه عوجه" -- reply 

ws[41] = "احبك" -- msg 
rs[41] = "لك غير هاذه مجنون بيك/ج " -- reply 

ws[42] = "محد يحبني" -- msg 
rs[43] = "انه احبك"-- reply 

ws[44] = "اموت عليك " 
rs[44] = " اكرهك🏃  " -- reply 

ws[45] = "محمد" -- msg 
rs[45] = "مشغول لو نايم اترك اله رساله @m1_l1" -- reply 

ws[46] =  "احبك" -- msg 
rs[46] = "رحمه ربك /ج لتزحف" -- reply 

ws[47] = "منو محمد" -- msg 
rs[47] = "مطور البوت" -- reply 

ws[48] = " الكروب نايم" -- msg 
rs[48] = " 😌غير البركه بيك🍃" -- reply 

ws[49] = "منو يحبني" -- msg 
rs[49] = "حمودي وبس 🌹🍃" -- reply 

ws[50] = "حمه" -- msg 
rs[50] = "مو كالو نفس ابوك👆" -- reply 

ws[51] = "حبي" -- msg 
rs[51] = " حبيبي" -- reply 

ws[52] = "حياتي" -- msg 
rs[52] = "عمري" -- reply 

ws[53] = "روحي" -- msg 
rs[53] =  " كلبي" -- reply 

ws[54] = "اموت" -- msg 
rs[54] = " اعشقك/ج" -- reply 

ws[55] = "شكد تحبني" -- msg 
rs[55] = "هواي" -- reply 

ws[56] = "عمري انته" -- msg 
rs[56] = "بعد روحي انته/انتي"-- reply 

ws[57] = "شكد تحبني"  -- msg
rs[57] = " موووت" -- reply 

ws[58] = "يا بعد عمري" -- msg 
rs[58] = "يعمري" -- reply 

ws[59] =  "اعشقك حسام" -- msg 
rs[59] = "رحمه ربك /ج لتزحف" -- reply 

ws[60] = "منو حبيبي" -- msg 
rs[60] = "انه" -- reply 

ws[61] = " منو حياتي" -- msg 
rs[61] = "انه" -- reply 

ws[62] = "منو يحبني" -- msg 
rs[62] = "🌹انه وبس🍃" -- reply 

ws[63] = "تتزوجني" -- msg 
rs[63] = "ليش لا" -- reply 

ws[64] = "شلونك حبي" -- msg 
rs[64] = " هلا كبد حياتي" -- reply 

ws[65] = " شلون صحتك" -- msg 
rs[65] = "بوجود مطوري الحمد الله" -- reply 

ws[66] = "منو مطور" -- msg 
rs[66] =  "@M1_l1" -- reply 

ws[67] = "شكو ماكو" -- msg 
rs[67] = "كاشي ماكو صافيه دافيه" -- reply 

ws[68] = " هه "  -- msg 
rs[68] = "وجع" -- reply 

ws[69] = "اكوللكم" -- msg 
rs[69] = "كلشي لتكول ما بينه حيل حماوتك"-- reply 

ws[70] = "وينكم" -- msg
rs[70] = "كلها بلخاص" -- reply 

ws[71] = "تعبان" -- msg 
rs[71] = "الله يساعدك/ج" -- reply 

ws[72] =  "تحبني" -- msg 
rs[72] = "امممممم لا " -- reply 

ws[73] = "طيبه" -- msg 
rs[73] = "فدوة لطولها فدشي" -- rely 

ws[74] = "وين هل ايام" -- msg 
rs[74] = "الله وكيلك دايح" -- reply 

ws[75] = "اموت عليك" -- msg 
rs[75] = "🌹اعشقك🍃" -- reply 

ws[76] = "هااا" -- msg 
rs[76] = "اسكت/ي اجكم /جكمه" -- reply 

ws[77] = "وينكم" -- msg 
rs[77] = "️محد موجود" -- reply 

ws[78] = "كبد محمد" -- msg 
rs[78] = "️طيوبه" -- reply 

ws[79] = "احبك" -- msg 
rs[79] = "تعالي خاص " 

-- the main function 
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), string.upper(v) ) ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      send_large_msg ( R , rs[i] ); 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "Mouamle" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @Mouamle" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end 
