do
ws = {}
rs = {}

— some examples of how to use this :3
ws[1] = "هلو" -- msg
rs[1] = "  هلوات 🌹 منور/ة 😊  " -- reply

ws[2] = "بوت" -- msg
rs[2] = "🐸🔫امر خدمه من طاح حضك/ج" -- reply

ws[3] = "شلونكم" — msg
rs[3] = "اني بالنسبة اليه دايح شوف بقيه الاعضااء 😂🖕" -- reply

ws[4] = "بوسني" -- msg
rs[4] =  " 💋😍ممَمَِمَِمَِمَِمِمِحَ تشَلع شَفتَي🙈😘🙊😋" -- reply

ws[5] = "حبك" -- msg
rs[5] = "مبين عليك زاحف نوعية فاخرة" -- reply

ws[6] = "جوعان" -- msg
rs[6] = "طبك مرض 🤕🤒🍃"-- reply

ws[7] = "باي" -- msg
rs[7] = " بايات 👋🏿 الله وياك/ج وردة 😊🌹 " -- reply

ws[8] = "اكرهك" -- msg
rs[8] = "علساس اني احبك تهي بهي 😒🍃" -- reply

ws[9] = "اتفل" -- msg
rs[9] = "ليش ما اترس وجهك تفال💦😚" -- reply

ws[10] = "زور" -- msg
rs[10] = "نعم حبيب كلبي❤️تفضل👍😎" -- reply

ws[11] = "تفاعل ماكو" -- msg
rs[11] = "بركه بيك" -- reply

ws[12] = "مرحبا" -- msg
rs[12] = "مراحب 🌹 منور/ة 😊" -- reply

ws[13] = "انجب" -- msg
rs[13] = "وك امرك حبي😢😞" -- reply

ws[14] = "زاحف" -- msg
rs[14] = "زاحف ع اختك مثلا🌚☝🏽️" -- reply

ws[15] = "عبدالله" -- msg
rs[15] = "مشغول👷 لو نايم 😴 اترك اله رسالة @a1_b1" -- reply

ws[16] = "مطور" -- msg
rs[16] = "@m1_l1 او @a1_bi او @m_mrs" -- reply

ws[17] = "حمودي" -- msg
rs[17] = "صـ😍😍ـاكة الكـٍْـْْروب😘😘" -- reply
— the main function
ws[18] = "امير" -- msg
rs[18] = "مشغول👷 لو نايم 😴اترك اله رسالة @m_mrs" -- reply

ws[19] = "طن" -- msg
rs[19] = "كش عاع✌🌚" -- reply

ws[20] = "😎" -- msg
rs[20] = "ضاربيك بوكس وتغطي عيونك حت محد يشوفك امداك👏🙌" -- reply

ws[21] = "السلام عليكم" -- msg
rs[21] = "  وعليكم 🐸✋ السلام ورحمة الله 👈😃" -- reply

ws[22] = "مرض" -- msg
rs[22] = " بـحلـكك 😴🍃" -- reply

ws[23] = "😒" -- msg
rs[23] = "ﺷﺒﮧ❃ہيكہ/ج.  كالب خـلـ🌚ـقتك🚶🏻" -- reply

ws[24] = "🌚" -- msg
rs[24] = "منور اصخام الجدر 😂✌" -- reply

ws[25] = "بوسه" -- msg
rs[25] = "ام😘😘💋💋💋ــہــواااااح" -- reply

ws[26] = "شبيك" -- msg
rs[26] = "ديٌّــ﴿🌝🚬﴾ــًُي" -- reply

ws[27] = "وين" -- msg
rs[27] = "بالــســ🚗ــيــارھہ" -- reply

ws[28] = "انته وين" -- msg
rs[28] = "بالــبــ🏡ــيــت" -- reply

ws[29] = "وينك" -- msg
rs[29] = "بالــســ🚗ــيــارھہ" -- reply

ws[30] = "شكرا" -- msg
rs[30] = "{ •• الـّ~ـعـفو •• }" -- reply

ws[31] = "ولو" -- msg
rs[31] = "شُـگـ{😍ê😍}ــرآآ" -- reply

ws[23] = "تمام" -- msg
rs[23] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣" -- reply

ws[33] = "دوم" — msg
rs[33] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَبْضّ قَلبْگ/ۈۈمْ}⌣" -- reply

ws[34] = "منور" — msg
rs[34] = "نِْـِْـــِْ([💡])ِْــــًِـًًـــِْـِْـِْـورِْكِْ" -- reply

ws[35] = "غنيلي" -- msg
rs[35] = " كلب كلب وين وين غايب عليه يومين لا تغيب اكثر حبيبي خاف اموت من ا لحنين @m1_l1" -- reply

ws[36] = "😡" -- msg
rs[36] = "امشي لك حماوة" -- reply

ws[37] = "تخليني" -- msg
rs[37] = "   هايه اخلاقك☝️🌚  " -- reply

ws[38] = "🙈" -- msg
rs[38] = "اوي عيني تستحي سندس🌚🍃" -- reply

ws[39] = "اريد اكبل" -- msg
rs[39] =  " وشسويلك😴" -- reply

ws[40] = "ضوجه" -- msg
rs[40] = " ودنيه عوجه" -- reply

ws[41] = "احبك" -- msg
rs[41] = "لك غير هاذه مجنون بيك/ج " -- reply

ws[42] = "محد يحبني" -- msg
rs[43] = "انه احبك" -- reply

ws[44] = "اموت عليك "
rs[44] = "اذوبن عليك😍 " -- reply

ws[45] = "محمد" -- msg
rs[45] = "مشغول 👷لو نايم😴 اترك اله رساله @m1_l1" -- reply

ws[46] =  "احبك" -- msg
rs[46] = "مبين عليك زاحف نوعية فاخرة" -- reply

ws[47] = "منو محمد" -- msg
rs[47] = "مطور البوت" -- reply

ws[48] = " الكروب نايم" -- msg
rs[48] = " 🌚غير البركه بيك🐸" -- reply

ws[49] = "منو يحبني" -- msg
rs[49] = "😁🙈عبودي وبس" -- reply

ws[50] = "حمه" -- msg
rs[50] = "منو كال نفس ابوك🌚☝️" -- reply

ws[51] = "حبي" -- msg
rs[51] = " حبيبي" -- reply

ws[52] = "حياتي" -- msg
rs[52] = "عمري" -- reply

ws[53] = "روحي" -- msg
rs[53] =  " كلبي" -- reply

ws[54] = "اموت" -- msg
rs[54] = " اعشقك/ج" -- reply

ws[55] = "شكد تحبني" -- msg
rs[55] = "هواي" -- reply

ws[56] = "عمري انته" -- msg
rs[56] = "بعد روحي انته/انتي" -- reply

ws[57] = "شكد تحبني" -- msg
rs[57] = " موووت" -- reply

ws[58] = "يا بعد عمري" -- msg
rs[58] = "يعمري" -- reply

ws[59] =  "🌝" -- msg
rs[59] = "هه" -- reply

ws[60] = "منو حبيبي" -- msg
rs[60] = "انه" -- reply

ws[61] = " منو حياتي" -- msg
rs[61] = "انه" -- reply

ws[62] = "منو يحبني" -- msg
rs[62] = "✋انه وبس😘" -- reply

ws[63] = "تتزوجني" -- msg
rs[63] = "ليش لا" -- reply

ws[64] = "شلونك حبي" -- msg
rs[64] = " هلا كبد حياتي" -- reply

ws[65] = " شلون صحتك" -- msg
rs[65] = "بوجود مطوري الحمد الله" -- reply

ws[66] = "منو مطور" -- msg
rs[66] =  "@M1_l1" -- reply

ws[67] = "شكو ماكو" -- msg
rs[67] = "كاشي ماكو صافيه دافيه" -- reply

ws[68] = " هه "  -- msg
rs[68] = "وجع" -- reply

ws[69] = "اكوللكم" -- msg
rs[69] = "كلشي لتكول ما بينه حيل حماوتك"-- reply

ws[70] = "وينكم" -- msg
rs[70] = "كلها بلخاص" -- reply

ws[71] = "تعبان" -- msg
rs[71] = "الله يساعدك/ج" -- reply

ws[72] =  "تحبني" -- msg
rs[72] = "اموت عليك اذوبن" -- reply

ws[73] = "😍" -- msg
rs[73] = "اموت على عيون كلوب الحب" -- rely

ws[74] = "وين هل ايام" -- msg
rs[74] = "الله وكيلك دايح" -- reply

ws[75] = "اموت عليك" -- msg
rs[75] = "❤️اعشقك❤️" -- reply

ws[76] = "هااا" -- msg
rs[76] = "اسكت/ي اجكم /جكمه" -- reply

ws[77] = "وينكم" -- msg
rs[77] = "محد موجود" -- reply

ws[78] = "🐍" -- msg
rs[78] = "كافي تزحفون على بنات العالم ماعدكم خوات" -- reply

ws[79] = "احبك" -- msg
rs[79] = "تعالي خاص "

ws[80] = "بلبوسين" -- msg
rs[80] = "امداكم ليش محد يحجي وياكم😂👏🙌" -- reoly

ws[81] = "@a1_b1" -- msg
rs[81] = "هذا الي صنعني فديت ربه  🙈❤️" -- reply

ws[82] = "زور انجب"-- msg
rs[82] =  "انجب انته فوك ما حامي لكروب😭🌚" -- reply

ws[83] = "دعم" -- msg
rs[83] =  "⁉️ رابط المجموعه 👥:https://telegram.me/joinchat/CtRzsz-mrqyJjkXe3AwKFQ" -- reply

ws[84] = "زور اتفل" -- msg
rs[85] = "✯خٍِخَّخّخِّخُّتـًً(✟💦😚✟)ـًًفِﯡﯟﯢۊﯝ✯🙈🌚" -- reply


ws[85] = "مح" -- msg
rs[85] = "محات نسخ لصق ع الشفه" -- reply

ws[86] = "منو عبدالله" -- msg
rs[86] = "مطور البوت" -- reply

ws[87] = " منو امير" --msg
rs[87] = "مطور البوت" -- reply

ws[88] = "شتكول عل زواحف" -- msg
rs[88] = "والله عمي بس الزواحف يكبلون شايفلك شريف كبل ماكو" -- reply

ws[89] = "زور شخبار حبيبتك" -- msg
rs[89] = "والله 🌚💔 تركتهة ️" -- reply

ws[90] = "ليش ولك تركتهة" -- msg
rs[90] = "برب زنجرت 😂💔 رب ما بقة براسهة️" -- reply

ws[91] = "السلام عليكم" -- msg
rs[91] = "وعليكم 👋🏿 السلام ورحمة الله 😊🌹" -- reply

ws[92] = "تا حسك زاحف" -- msg
rs[92] = "اي والله 😁 اسحف علة ابوية اريد فلوس 🐼💔" -- reply

ws[93] = "تسلم" -- msg
rs[93] = "🙈😘❤️ادلل حبي" -- reply

ws[94] = "قفل السبلت" -- msg
rs[94] = " 🍃😮تم✅قفل السبلت  💔😞" -- reply


ws[95] = "قفل خالتك" -- msg
rs[95] = "تم✔️قفل 5 خالتك😈😂✌️" -- reply

ws[96] = "شكاعد تسوي هسة" -- msg
rs[96] = "والله لازم البطل والجكارة وصك بيهن" -- reply

ws[98] = "شتكول عل بوتات الجديدة" -- msg
rs[98] = "طيط بطورين ههه" -- reply

ws[99] = "منو اقوة بوت" -- msg
rs[99] = "اني طبعن دي دي لحد يوصل" -- reply

ws[100] = "فتح خالتك" -- msg
rs[100] = "تم ✔️فتح 5خالتك😈_وينهم جماعت الحلكامي 😋✌️ " -- reply

ws[101] = "فتح المبرده" -- msg
rs[101] = "تم✔️فتح المبرده🙈بس مي مكطوع😅🚱️" -- reply


ws[102] = "قفل المبرده" -- msg
rs[102] = "تم✔️قفل المبرده☹️ليش الله وكبر عليك حاره😞♨️" -- reply

ws[103] = "فتح السبلت" -- msg
rs[103] = "تم✅فتح السبلت😊اشبعو بخيخ😂🌚️" -- reply

ws[104] = "واكف" -- msg
rs[104] = "لا خطيه ليش واكف كعده وشربه جاي😜🌚️" -- reply

ws[105] = "اكرهك" -- msg
rs[105] = "علساس اني احبك تهي بهي 😒🍃️" -- reply

ws[106] = "😐" -- msg
rs[106] = "شبيك صافن 😳تاحسك ابو صابر 🐴😂🌚️" -- reply

ws[107] = "😞" -- msg
rs[107] = "لضوج حبيبي ❤️😍😘" -- reply

ws[108] = "زور ضجت خل نطلع" -- msg
rs[108] = "اوكف خل البس خذائي👟 وليحبني يجي ورايه🌚😂" -- reply

ws[109] = "زور غني" -- msg
rs[109] = "كلب كلب وين وين غليب عليه يومين لتغيب اكثر حبيبي خاف اموت من الحنين @a1_b1" -- reply

ws[110] = "😹" -- msg
rs[110] = "فديت هالضحكة الحلوة انشالله دوم مو يوم😘" -- reply

ws[111] = "😒" -- msg
rs[111] = "ﺷﺒﮧ❃ہيكہ/ج.  كالب خـلـ🌚ـقتك🚶🏻" -- reply

ws[112] = "وينك" -- msg
rs[112] = " ااجيت بالــس_🚗_ــيــارھہشبيك مستعجل"-- reply

ws[113] = "😂😂😂" -- msg
rs[113] = " يممه فوطيت الخشم والضحكه جنك/ج مادري شني 😹🌚" -- reply

ws[114] = "وين هل ايام" -- msg
rs[114] = "الله وكيلك دايح" -- reply

ws[115] = "تف" -- msg
rs[115] = "عيب ابني تتفل اكبر شويه🌚💔😹️" -- reply

ws[116] = "ختفو" -- msg
rs[116] = "يع وين تربيتي فيك انا علمتك تتفل😑🖕️" -- reply

ws[117] = "غلس" -- msg
rs[117] = "اعمل حالك/ج😴 ميت" -- reply

ws[118] = "زور شنو رايك بهاذ " -- msg
rs[118] = "فد واحد سرسري وصاگط ويلعب ع البنات ابن الصخله 🐐 سوالفه كله عندي🌚🍃😂" -- reply

ws[119] = "قزومه" -- msg
rs[119] = "امج جابتج🙀 واحنه بتلينه😪 يالطولج شبر شمسويه بينه😻" -- reply

ws[120] = "زاحفه" -- msg
rs[120] = "لججج استحيي😾 وجه الطاوه🍳" -- reply

ws[121] = "💋" -- msg
rs[121] = "عيب ولج🙈استحي منا عالم" -- reply

ws[123] = "😂" -- msg
rs[123] = " يممه فوطيت الخشم والضحكه جنك/ج مادري شني 😹🌚" -- reply

ws[124] = "😭" -- msg
rs[124] = "لا تبجي هك 🍼🍃ننه" -- reply

ws[125] = "🚶" -- msg
rs[125] = "وين رايح عيب منا بنات 🐱🍃" -- reply

ws[126] = "🏃" -- msg
rs[126] = "اركضض🌬💨🏃 لا تسويه ع نفسك😹🙀" -- reply

ws[127] = "بوس عمك الحديقه" -- msg
rs[127] = "😖😹ويعع 😳شوف الجرب البي" -- reply

ws[128] = "اجيت" -- msg
rs[128] = "لا هله بيك/ج😪" -- reply

ws[129] = "يلا" -- msg
rs[129] = "اوكف بس هن اشد القيطان 😹😹" -- reply

ws[130] = "دي" -- msg
rs[130] = "طيط💨 انت دي🌝🚬 يافاشل💦" -- reply

ws[131] = "اضافه" -- msg
rs[131] = "انتضر الادمنيه😐💔" -- reply

ws[132] = "شكد" -- msg
rs[132] = "😏فوك ماتصور😻🙈" -- reply


ws[133] = "شبيهم" -- msg
rs[133] = "ذولي مضغوطين🖕🏿🌚" -- reply

ws[134] = "بنيه" -- msg
rs[134] = "😏واذا بــنــيــه🌚 مـــا تشـــوفــيـن😒 شــون الله مطـيــح حظج😈" -- reply

ws[135] = "اني" -- msg
rs[135] = "انت🌚 واحــد😒 ملطلـــط😡مــــا تكعـــد وتسكت😂😘" -- reply

ws[136] = "جاووو" -- msg
rs[136] = "😉أخَذَ/ي رآَحَتكَ 👍🏼حبَيَبَ كلَبي😘️🙊😋" -- reply

ws[137] = "فديت" -- msg
rs[137] = "😘فدِآكـ آلكؤن🙈ؤمَآي آَلَعيـونْ😚ؤقوآطيْ المَعجَون❤️🙊😋" -- reply

ws[138] = "عبودي" -- msg
rs[138] = "فديت طولة الحلو😍😘🙈" -- reply

ws[139] = "بلبوسين" -- msg
rs[139] = " امداكم ليش محد يحجي وياكم👏🙌😂" -- reply

ws[140] = "اموري" -- msg
rs[140] = "امير فديته لو اندل بيته جان حبيته😍" -- reply

ws[141] = "حمودي" -- msg
rs[141] = "بعد امة فديتة لو اندل بيتا😘😍🙈" -- reply

ws[142] = "غسو" -- msg
rs[142] = "حبيبت اموري فديتهم يخبشون😍" -- reply

ws[143] = "🚬🐸" -- msg
rs[143] = "هلا معلم نورت الكروب😎👍" -- reply

ws[144] = "👏" -- msg
rs[144] = "عفية بالسبع" -- reply

ws[145] = "😱" -- msg
rs[145] = "خير ياستار شصاير" -- reply

ws[146] = "😪" -- msg
rs[146] = "امسح/ي شخطانتك/ج وكافي بجي عالراح الله يعين" -- reply

ws[147] = "😉" -- msg
rs[147] = " عيب تغمز/ين منا عالم اذا تريدني/يني تعال خاص🍃😎" -- reply

ws[148] = "😞" -- msg
rs[148] = "الله يساعدك/ج ويعوضك/ج" -- reply

ws[149] = "اكل نعال" -- msg
rs[149] = "شنو هالميانا الزايدة لاعب وياك كبل" -- reply

ws[150] = "😴" -- msg
rs[150] = "نايم الحلو لحد يكعدا" -- reply

ws[151] = "😘" -- msg
rs[151] = "الله بوسة عسل مثل صاحبها" -- reply

ws[152] = "☺️" -- msg
rs[152] = "فديتا ابو خدود التفاح لو اندل بيتا" -- reply

ws[153] = "😇" -- msg
rs[153] = "شمسوي مكسورة احجي فضني🌚😂" -- reply

ws[154] = "🐒" -- msg
rs[154] = "ليش تنشر صورة اخوك😂🍃" -- reply

ws[155] = "👻" -- msg
rs[155] = "اني خفت بس مو من  القناع خفت من صوتك/ج الجنة صوت ابو صابر🐴😂" -- reply

ws[156] = "🌹" -- msg
rs[156] = "وانت/ي عطرها حبيبي/تي الغالي/ة😘🙊" -- reply

ws[157] = "🚲" -- msg
rs[157] = "وعلي اجيناكم بالبايسكل والا طحين😂🍃" -- reply

ws[158] = "😁" -- msg
rs[158] = "سنونك/ج انضف من مستقبلي🐸🌚" -- reply

ws[159] = "نونه" -- msg
rs[159] = "هاي الضلعة مالتي واليحجي عليها اكتلة مفهوم💥💥🔫🐸" -- reply

ws[160] = "🔫" -- msg
rs[160] = "ماوصيك/ج اكلتلني/يني هاي تربيتك/ج" -- reply

ws[161] = "😌" -- msg
rs[161] = "والمطلوب؟؟" -- reply

ws[162] = "🤓" -- msg
rs[162] = "افتهمنا شاطر/ة انزع/ي المناظر طالع وج ابو صابر🐴😂" -- reply

ws[163] = "😋" -- msg
rs[163] = "بالعافية بس علقلية عزمنا وياك😁🍃" -- reply

ws[164] = "💩" -- msg
rs[164] = "لتنشر صورة وجك لان وجك مو مال تلي مال حمام😝😂" -- reply

ws[165] = "👀" -- msg
rs[165] = " على شنو دا تباوع بله الله وكيلك عيون العتوي🐱🍃" -- reply

ws[166] = "👍" -- msg
rs[166] = "حبيب كلبي انت هم تعجبني👍" -- reply

ws[167] = "😀" -- msg
rs[167] = "ابتسامة خلفها طلب فضني شريد😂" -- reply

ws[168] = "راب" -- msg
rs[168] = "MoAماسترز اوف ارت 😎👍" -- reply

ws[169] = "🗣" -- msg
rs[169] = "كافي تصيح طرشت اذاني👂وكعدت جهالي👫حسبي الله منك" -- reply

ws[170] = "🌞" -- msg
rs[170] = "شيجبك عالشمس يمصخم الوج 🌚" -- reply

ws[171] = "واحد"  -- msg
rs[171] = "وثنين وتلاثة واربعة  دي لتلزك🚬🌝" -- reply

ws[172] = "🙄" -- msg
rs[172] = "نزل عيونك شعدك تباوع فوك عيون الفارة🐭" —- reply

ws[173] = "لتزحف" -- msg
rs[173] = "وك اسف🤐" -- reply

ws[174] = "دقيقة" -- msg
rs[174] = "صار ساعه⏰مو. دقيقه" -- reply

ws[175] = "حاته" -- msg
rs[175] = "وينها دز صورتها" -- reply

ws[176] = "ليش" -- msg
rs[176] = "😂تاكل خرة الجيش" -- reply

ws[177] = "اذن المغرب" -- msg
rs[177] = "استحرم✋🌚" -- reply

ws[178] = "اروح اصلي" -- msg
rs[178] = "انت حافظ سورة الفاتحة😍❤️" -- reply

ws[179] = "منو" -- msg
rs[179] = "تاج راسك صكارك 🐸" -- reply

ws[180] = "شلونك زور" -- msg
rs[180] = "الحمدالله بشوفتك صرت زين" -- reply

ws[181] = "زور شنسوي للزاحف" -- msg
rs[181] = "اعلكا من كفشتة واسوي جيس ملاكمة" -- reply

ws[182] = "فديت" -- msg
rs[182] = "ها زاحف كمشتك🔫😎" -- reply

ws[183] = "راح اغادر" -- reply
rs[183] = "متولي الله الله الله وياك حجارة عبعوب ونشالت من الكروب" -- reply

ws[184] = "الله الله الله وياك" -- msg
rs[184] = "لعد بطلت ما روح لازك على كلبك" -- reply

ws[185] = "زور ليش تزحف" -- msg
rs[185] = "لازم زاحف عليك/ج" -- reply

ws[186] = "انت بوت فاشل" -- msg
rs[186] = "لعد شعندك بمجموعتي يالله برة" -- reply

ws[187] = "اريد بوت" -- msg
rs[187] = "زور تحت خدمتك 🚬😎" -- reply

ws[188] = "محضور" -- msg
rs[188] = "موفتهمنا الشعب العراقي كلة محضور من ورة الزحف دكعدو راحة🐸🍃" -- reply

ws[189] = "البوت عاوي" -- msg
rs[189] = "تريد اطردك مثلا???" -- reply

ws[190] = "هلو صديقي" -- msg
rs[190] = "اهو هم اجا/ت الحماوة😡 هلا بيك/ج حبيبي/تي" -- reply

ws[191] = "كلكسي" -- msg
rs[191] = "قصدك النعمر بي النركيله بمكان الفحم" -- reply

ws[192] = "🤔" -- msg
rs[192] = "ترة شكد متصفنلها متنحل" -- reply

ws[193] = "الو" -- msg
rs[193] = "ارهابي عالخط🙀ابتعد ميت متر عني" -- reply

ws[194] = "😅" -- msg
rs[194] = "شسويت مكسورة يالله كول👊😾" — reply

ws[195] = "صاكة" -- msg
rs[195] = " وداعتك هي جبار ابو المولدة بس كلة مكياج💄" -- reply

ws[196] = "تعاركت" -- msg
rs[196] = "اكيد سحلوك/ج ومسحو بيك/ج الكاع بس نضطر نصدك انت/تي صرت/ي سوبر مان" -- reply

ws[197] = "سحك" -- msg
rs[197] = "عاتي الميسحك مو عراقي" -- reply

ws[198] = "اروح اسبح" -- msg
rs[198] = "بس خلصنا من ريحتك التكتل😷" -- reply

ws[199] = "هع" —--msg
rs[199] = "ههعهاعه التهعع عظامك" -- reply

ws[200] = "افلش الكروب" -- msg
rs[200] = "افلش راس ابوك 👨وامك👩 فاشل" -- reply

ws[201] = "ضوجه" -- msg
rs[201] = "شي اكيد الكبل ما موجود لو بعدك/ج مزاحف/ة🐍🐍🐍" -- reply

— the main function
function run( msg, matches )
   — just a local variables that i used in my algorithm
   local i = 0; local w = false

   — the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
   — this section loops through all the words table and assign { k } to the word index and { v } to the word itself
   for k,v in pairs(ws) do
      — change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern
      if ( string.find(string.upper(msg.text), string.upper(v) ) ) then
         — assign the { i } to the index of the reply and the { w } to true ( we will use it later )
         i = k; w = true;
      end
   end

   — check if { w } is not false and { i } not equals to 0
   if ( (w ~= false) and (i ~= 0) ) then
      — get the receiver :3
      R = get_receiver(msg)
      — send him the proper message from the index that { i } assigned to
      send_large_msg ( R , rs[i] );
   end
   — don't edit this section
   if ( msg.text == "about" ) then
      if ( msg.from.username == "a1_b1" ) then
         R = get_receiver(msg)
         send_large_msg ( R , "Made by @a1_b1" );
      end
   end

end

return {
   patterns = {
      "(.*)"
     },
     run = run
}

end