--[[
#
#ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#😩
# For More Information ....! 
# Developer :  < @M1_l1 > 
#  Developer :  < @A1_b1 > 
# our : vrbot
# Version: 1.1
#:))
#ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#

do

function run(msg, matches)
local reply_id = msg['id']
  local S = '❣  السورس 🛢 ASD_KARBALA 📁\n❣  الاصدار 📋 v1.2\n❣ الموقع 💻\n \nhttps://github.com/SAJJAD94/ASD_KARBALA.git \n❣   #المطور : @SAJJADNOORI \n❣ #بوت_المطور : @S94_BOT \n ❣ #قناة_البوت : @S94IQ'
reply_msg(reply_id, S, ok_cb, false)
end

return {
  patterns = {
"^(الاصدار)$",
  }, 
  run = run 
}

end
