do

function run(msg, matches)
  return [[ 


✔️تعمل جميع الاوامر بدون وضع / او !
ا🔸➖🔹➖🔸➖🔹➖🔸

👻 الاوامر : لضهار اوامر الاريسيه

👻 مساعده : لضهار  الاوامر  الثانويه
          [ويمكن للعضو استخدامها]

❣م المطور : لعرض اوامر المطور

❣الاصدار : لعرض موقع السورس✋🏿

❣dev  : لعرض من صنع البوت اوالسورس

ا🔸➖🔹➖🔸➖🔹➖🔸
👇 
                
👇🏿للأستفسار:- راسل المطور:- ☢⚜ 
Developer :  < @abo_shosho98 > 
Developer :  < @aboaloshbot >

ااطلب البوت من كروب الدعم 

https://telegram.me/joinchat/CgJAOj8AzQADEPGYx-FbQA

]]


end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(تفعيل المجموعه)$",
},
run = run 
}
end
