--[[
#
#ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#😩
# For More Information ....! 
# Developer :  < @M1_l1 > 
#  Developer :  < @A1_b1 > 
# our : vrbot
# Version: 1.1
#:))
#ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#
]]
do

function run(msg, matches)
local reply_id = msg['id']
local S = [[
 

✔️  الاوامر الايدي والمعلومات. ✅🔰👷
👷 ايدي : لاظهار ايدي المجموعه
👷 ايدي : لاظهار ايدي الشخص بلرد
👷 معلوماتي : اضهار المعلومات الخاصه بك
👷 معلومات المجموعه : اضهار معلومات بالمجموعة
👷 الاعدادات : اضهار اعدادات المجموعة
👷 اعدادات الوسائط : اضهار اعادادات الوسائط
 ▒▒▒▒▒▒▒▒▒▒🔙🔜▒▒▒▒▒▒▒▒▒▒
 🎊 صوت : الكلمة المراد نطقها
        صوت  SAJJAD [يدعم الانلكش فقط]

 🎃 صوره : الكلمه المراد تحويلها صوره
[يدعم الانلكش فقط] 
 🎃 خريطه : لجلب الخرائط خريطه العراق

 🎃 انستا : اليوزر لمعرفه معلومات الانستا

 🎃 ملصق : قم بارسال صورة
        وقم بلرد عليها بكلمة لجعله ملصق
 🎃 صوره : قم بارسال ملصق
 وقم بالرد  عليه لجعلها صورة
ا🔸➖🔹➖🔸➖🔹➖🔸
🃏🔺للأستفسار:- راسل المطور :- ☢⚜ 
✋🏿👇🏿
Developer :  < @M1_l1 > 
Developer :  < @A1_b1 >
 ]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م2)$",
},
run = run 
}
end
