do

function run(msg, matches)
  return [[ 



🌐 -  !time+(المحافظة او دولة(انكلش
===================================================
🌐 - الطقس + المنطقه(انكلش) : لضهار حاله الجو 
===================================================
🌐 -/الاذان + المنطقه(انكلش ) : الاضهار اوقات الاذان
===================================================
🌐 - الاصدار : لضهار معلومات السورس
===================================================
🌐 - /tr +الكلمه المراد ترجمتها  
===================================================
🌐 - sher : لبحث عن لعبه او برنامج 
===================================================
🌐- me : لضهار موقعك في البوت
===================================================
🌐- ايدي : لاظهار ايدي المجموعة
==================================================
=
🌐- ايدي : لاظهار ايدي الشخص بلرد
==================================================
=
🌐- معلومات المجموعه : اضهار معلومات بالمجموعة
==================================================
=
🌐- الاعدادات : اضهار اعدادات المجموعة
==================================================
=
🌐- اعدادات الوسائط : اضهار اعادادات 
==================================================
= 
🌐- صوت  mohamed [يدعم الانلكش فقط]
==================================================
=
🌐- ملصق : قم بارسال صورة
        وقم بلرد عليها بكلمة لجعله ملصق
==================================================
======
🌐- صوره : قم بارسال ملصق
 وقم بالرد  عليه لجعلها صورة
=========================================================================================
=
🃏🔺للأستفسار:- راسل المطور :- ☢⚜ 
✋🏿👇🏿
Developer :  < @DEV_m1 > 
Developer :  < @A1_b1 >
Developer :  < @m_mrs >                                                        ‏ 
 ]]

end

return {
  description = "Shows bot help", 
  -- usage = مساعده: Shows bot help",
  patterns = {
    "^مساعده$"
  }, 
  run = run 
}

end
