do

function run(msg, matches)
  return [[ 
🌐 - الوقت + المنطقه(انكلش) : لمعرفه الوقت
===================================================
🌐 - الطقس + المنطقه(انكلش) : لضهار حاله الجو 
===================================================
🌐 - !الاذان + المنطقه(انكلش ) : الاضهار اوقات الاذان
===================================================
🌐 - الاصدار : لضهار معلومات السورس
===================================================
🌐 - tr +الكلمه المراد ترجمتها  
===================================================
🌐 - sher : لبحث عن لعبه او برنامج 
===================================================
🌐 me : لضهار موقعك في البوت
===================================================
 ]]

end

return {
  description = "Shows bot help", 
  -- usage = مساعده: Shows bot help",
  patterns = {
    "^مساعده$"
  }, 
  run = run 
}

end 
